#
# Copyright (C) 2015 Orange
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
# http://www.apache.org/licenses/LICENSE-2.0
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
#

portal.designer.service.mom.title             = MOM interne
portal.designer.service.mom.description.0       = Ce service permet d'envoyer dans des files d'attente et de recevoir des messages asynchrones qui sont consomm\u00e9s dans la m\u00eame application.
portal.designer.service.mom.description.1       = La version 1.1 de l'API JMS est support\u00e9 avec le support de transaction XA.
portal.designer.service.mom.description.2       = Limitations li\u00e9es \u00e0 l'API JMS :
portal.designer.service.mom.description.3       = - Le champ JMS ReplyTo dans un message n'est pas support\u00e9
portal.designer.service.mom.description.4       = - Seules les files d'attentes sont support\u00e9es (les topic sont planifi\u00e9s pour une prochaine version)

portal.designer.service.mom.main.letter = file principale
# functional
portal.designer.service.mom.ml.label = label
portal.designer.service.mom.ml.destinationName         = nom JNDI de la queue
portal.designer.service.mom.ml.jmsConnectionFactoryJndiName      = nom JNDI ConnectionFactory

# Help tooltip for functional main destination
portal.designer.service.mom.ml.destinationName.help         = Nom JNDI sous lequel l'instance de la Destination sera disponible. Il doit \u00eatre unique pour toutes les files internes connect\u00e9es \u00e0 cette architecture.
portal.designer.service.mom.ml.jmsConnectionFactoryJndiName.help      = Nom JNDI sous lequel l'instance de la ConnectionFactory sera disponible. Cette factory supporte les transactions XA, et de fait peut \u00eatre incluse dans une transaction avec un service RDB. Le manageur de transaction JTA est disponible dans le JNDI \u00e0 l'endroit par d\u00e9faut. Actuellement, cette factory est disponible par d\u00e9faut sous le nom "CF".

# Non Functionnal
portal.designer.service.mom.nonfunctional = attributs non fonctionnels
portal.designer.service.mom.ml.msgMaxSizeKB      = taille max des messages (Kb)
portal.designer.service.mom.ml.destinationCapacity     = capacit\u00e9 de la destination (nb msg)
portal.designer.service.mom.ml.persistentMessagesUsed = utilisation de messages persistants
portal.designer.service.mom.ml.highAvailability         = haute disponibilit\u00e9

# Help tooltip for non functional main destination
portal.designer.service.mom.ml.msgMaxSizeKB.help      = Devrait \u00eatre plus petit que 10MB. Elle est mesur\u00e9e comme un nombre d'octets de l'objet message java serialis\u00e9. Cette information est utilis\u00e9e pour dimensionner l'espace de stockage des messages.
portal.designer.service.mom.ml.destinationCapacity.help     = Nombre maximum de messages \u00e0 en attente dans la file quand le destinataire ne consomme pas les messages. Il devrait comprendre \u00e9galement les messages envoy\u00e9s par les ExecNode qui utilisent ce Service MOM. Il est \u00e0 noter que la file elle m\u00eame peut augmenter ce nombre maximum de messages. Quand la capacit\u00e9 maximum est atteinte, le prochain message envoy\u00e9 sera rejet\u00e9. De nombreux messages peuvent \u00eatre rejet\u00e9 si le persistent storage n'est pas assez dimensionn\u00e9 pour garantir les SLO.
portal.designer.service.mom.ml.highAvailability.help         = A l'avenir, cette activation permettra de provisionner les files pour la Haute Disponibilit\u00e9.

# Dead Letter
portal.designer.service.mom.dead.letter = file de rebut
portal.designer.service.mom.dl.hasDeadLetterQueue   = Activer une file de rebut
portal.designer.service.mom.dl.deadLetterQueueName     = nom JNDI de la file
portal.designer.service.mom.dl.deadLetterQueueCapacity = capacit\u00e9 de la file
portal.designer.service.mom.dl.retriesBeforeMovingToDeadLetterQueue  = nombre d'essais avant de partir au rebut

# Help tooltips for dead letter
portal.designer.service.mom.dl.hasDeadLetterQueue.help   = Cocher pour activer la file de rebut. Une file de rebut re\u00e7oit les messages qui produisent des erreurs au cours de la r\u00e9ception.
portal.designer.service.mom.dl.deadLetterQueueName.help     = Nom JNDI sous lequel l'instance de la file des rebuts sera disponible. Plusieurs queues peuvent partager une m\u00eame file de rebut.
portal.designer.service.mom.dl.deadLetterQueueCapacity.help = Information pour le paas pour dimensionner la file de rebut. Le nombre maximum de messages pouvant \u00eatre contenus dans la file. Quand la capacit\u00e9 maximum est atteinte, les messages non trait\u00e9s sont perdus (l'ops de l'application devrait regarder les logs dans de tels cas).
portal.designer.service.mom.dl.retriesBeforeMovingToDeadLetterQueue.help  = A la r\u00e9ception en erreur d'un message (par exemple un rollback de transaction pendant le traitement, ou une exception lanc\u00e9e), c'est le nombre maximum de fois que le message sera envoy\u00e9 au destinataire avant de partir au rebut.

#Image
internalMom-icon										= images/designer/internal-mom-icon.png